print('Приветствую Вас в программе Fit Life!!!')
# Приветствие пользователя
user_name = input('Как я могу к Вам обращаться? ').capitalize()
# Присвоили user_name имя и привели к нужному регистру
user_age = int(input('Введите Ваш полный возраст '))
# Присвоили user_age возраст преобразуя строку в число
user_weight = float(input('Введите ваш вес (в кг) '))
# Присвоили user_weight кг и перевели в формат float
user_height = float(input('Введите ваш рост в метрах (например 1.75) '))
# Присвоили user_height рост и перевели в формат float
bmi = round(user_weight / (user_height ** 2), 1)
# Присвоили bmi индекс массы тела и округлили до одного знака после запятой
water_balance = 30
# Cтандартная рекомендация для поддержания водного баланса
liter = 1000
# В одном литре 1000 мл.
water_ml = user_weight * water_balance
# Рассчитать норму воды в миллилитрах
water_l = round(water_ml / liter, 1)
# Перевели миллилитры в литры и округлили до 1 знака после запятой
print('-------------------------------------------------')
# Отделяющая строка для начала отчета
print(f'Отчет для пользователя: {user_name} ({user_age} г.)')
# Выводит пользователю имя и возраст
print(f'Ваш Индекс Массы Тела: {bmi}')
# Выводит пользователю индекс массы тела
print(f'Рекомендуемая норма воды: {water_l} л. в день')
# Выводит пользователю норму воды
print('-------------------------------------------------')
# Отделяющая строка для конца отчета
print("Расчет окончен. Будьте здоровы!")
